package by.tms.lesson1;

/**
 * Написать приложение, которое будет вычислять и выводить значение по формуле:
 * a=4*(b+c-1)/2; b и c задаем в коде самостоятельно.
 */
public class Task_1 {
    public static void main(String[] args) {

        int b = 2, c = 5;
        int a = 4 * (b + c - 1) / 2;
        System.out.println(a);

    }
}
